
&НаКлиенте
Процедура СообщитьКонтекст(Команда)
	ОчиститьСообщения();
	Сообщить("Тек время:"+ТекущаяДата());
	СообщитьКонтекстСервер();
КонецПроцедуры

&НаСервере
Процедура СообщитьКонтекстСервер()
	Документы.Расход.ЭтоСервер();
КонецПроцедуры


&НаСервере
Процедура ВключитьИсториюНаСервере()
	
	Насторойки = Новый НастройкиИсторииДанных;
	Насторойки.Использование = Истина;
	
	ИсторияДанных.УстановитьНастройки(Метаданные.Документы.Расход, Насторойки);
	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьИсторию(Команда)
	ВключитьИсториюНаСервере();
КонецПроцедуры


&НаСервере
Процедура ИсторияУдалитьНаСервере()
	ИсторияДанных.УдалитьВерсии(Метаданные.Документы.Расход);
КонецПроцедуры



&НаКлиенте
Процедура ИсторияУдалить(Команда)
	ИсторияУдалитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика   
КонецПроцедуры


