
&НаКлиенте
Процедура ТоварыПометкаДа(Команда)

	ПометкаУстановитьСнять(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПометкаДа(Команда)
	
	ПометкаУстановитьСнять(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУстановитьСнять(п_Значение)
	
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент) <> Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого мСтрока из Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ВыделенныеСтроки Цикл
		СтрокаТЗ = ЭтаФорма[ЭтаФорма.ТекущийЭлемент.Имя].НайтиПоИдентификатору(мСтрока);
		СтрокаТЗ.Пометка = п_Значение;
	КонецЦикла;	
		
КонецПроцедуры	

&НаКлиенте
Процедура КомплектующиеПометкаНет(Команда)
	ПометкаУстановитьСнять(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПометкаНет(Команда)
	ПометкаУстановитьСнять(Ложь);
КонецПроцедуры
